Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/sudden_or_unexplained_death/postmortems.html.txt.tmx
Source language: en
Languages: ga

source: In certain situations when someone dies in Ireland, it may be necessary to carry out a postmortem examination (also called an autopsy) of the deceased's body
ga: I gcásanna faoi leith nuair a chailltear duine in Éirinn, d'fhéadfadh sé go mbeadh gá le scrúdú iarbháis (tugtar corpdhioscadh ar seo freisin) a dhéanamh ar chorp an mhairbh

source: A postmortem examination is a medical examination of a dead body to determine the exact cause of death
ga: Scrúdú leighis é an scrúdú iarbháis a dhéantar ar chorp an mhairbh le cúis chruinn an bháis a dhéanamh amach

source: In the case of a violent death, the postmortem may be necessary as part of a criminal investigation
ga: I gcás anbháis d'fhéadfadh sé go mbeadh gá leis an scrúdú iarbháis mar chuid de fhiosrú coiriúil

source: Postmortems in Ireland are carried out by a specific type of physician called a 'pathologist'
ga: In Éirinn is dochtúir speisialta ar a dtugtar a dhéanann scrúduithe iarbháis a chur i gcrích

source: It's important to remember that during a postmortem examination, the body is treated with utmost respect and no disfigurement of the body takes place
ga: Tá sé tábhachtach cuimhniú go dtugtar omós den chaighdeán is airde don chorp le linn scrúdaithe iarbháis agus nach bhfágtar aon mháchail ar an gcorp

source: In fact, the body may be viewed afterwards, and usually should not delay funeral arrangements
ga: Is amhlaidh gur féidir breathnú ar an gcorp ina dhiaidh agus is iondúil nach gcuirtear aon mhoill ar na socruithe sochráide

source: The family or next of kin will normally be asked for their permission before a postmortem is carried out
ga: Is iondúil go n-iarrtar cead an teaghlaigh nó an neasghaoil sula ndéantar scrúdú iarbháis

source: However, where a Coroner has ordered a postmortem examination, the permission of the next of kin is not necessary
ga: Ach, nuair a ordaíonn an Cróinéir scrúdú iarbháis níl aon ghá le cead a fháil ón neasghaol

source: During a postmortem examination, all body cavities (head, chest and abdomen) are examined and the organs dissected
ga: Déantar scrúdú ar gach coguas coirp (cloigeann, cliabhrach agus bolg) le linn scrúdaithe iarbháis agus na baill bheatha ar fad a dhioscadh

source: Small blocks of tissue and blood samples may be retained by the pathologist for further examination
ga: D'fhéadfadh sé go mbeadh míreanna beaga fíocháin agus samplaí fola coinnithe ag an bpaiteolaí le tuilleadh scrúdaithe a dhéanamh orthu

source: Occasionally, it may be necessary for the pathologist to retain a whole organ (or organs) for more detailed examination in order to establish the cause of death
ga: Ó am go chéile, d'fhéadfadh sé go mbeadh ar an bpaiteolaí ball beatha ina iomlán a choinneáil (nó baill bheatha) le mionscrúdú a dhéanamh orthu le cúis an bháis a dhéanamh amach

source: Where an organ is retained, this is purely for the purpose of establishing or clearly determining the cause of death
ga: Nuair a dhéantar ball beatha a choinneáil, déantar é seo ar mhaithe leis an gcúis bháis a dhéanamh amach amháin

source: Consent of the next-of-kin is not required, but they will be notified
ga: Níl aon ghá le cead a fháil ó na neasghaolta, ach cuirfear scéal chucu

source: In addition, the next-of-kin will be required to express a preference for ultimate disposal of any organs removed
ga: Chomh maith, iarrfar ar na neasghaolta moladh a dhéanamh cén chaoi gur mhaith leo fáil réidh ag deireadh thiar thall le aon bhaill bheatha a coinníodh

source: Retention of an organ for any other purposes by a pathologist (i.e., teaching, research, etc.) requires specific consent from the next-of kin
ga: Teastaíonn cead faoi leith ó na neasghaolta más mian leis an bpaiteolaí aon bhall beatha a choinneáil ar aon chúis eile (mar shampla, cúrsaí teagaisc nó taighde & rl)

source: Following the postmortem examination, the body will normally be released to the spouse or next-or-kin immediately after the examination has been completed
ga: Is iondúil go mbeidh an corp curtha ar fáil don chéile nó do na neasghaolta díreach tar éis an scrúdaithe iarbháis a bheith déanta

source: Although the need for a postmortem will not usually delay the funeral, the results may not be available until three to eight weeks later
ga: Cé nach iondúil go gcuireann scrúdú iarbháis moill ar chúrsaí sochraide, d'fhéadfadh sé nach mbeadh na torthaí ar fáil go ceann trí go ocht seachtainí

source: In certain circumstances, it may be several weeks before the postmortem report is received from the pathologist
ga: I gcúinsí faoi leith, d'fhéadfadh sé roinnt seachtainí a thógáil go dtí go mbeadh an tuairisc ar an scrúdú iarbháis faighte ón bpaiteolaí

source: For example, in situations where a toxicology (drug) screen is required it may be several months before the postmortem report is completed
ga: Mar shampla, sa chás go bhfuil scrúdú tocsaíneolaíochta (drugaí) ag teastáil d'fhéadfadh roinnt míonna dul thart go dtí go mbeadh tuairisc an scrúdaithe iarbháis críochnaithe

source: Queries relating to postmortem reports should be made to the Coroner’s office and not to the hospital concerned
ga: Ba cheart fiosrúcháin maidir le tuairiscí ar scrúduithe iarbháis a dhéanamh le hoifig an Chróinéara níl aon bhaint ag an ospidéal a bhí i gceist leis an scéal

source: You can discuss the results with the deceased's doctor once the results are available, and you can then proceed with registering the death in the usual way
ga: Is féidir leat na torthaí a phlé le dochtúir an mhairbh nuair atá siad ar fáil, agus is féidir leat ansin dul ar aghaidh agus an bás a chlárú sa ghnáthbhealach

source: You cannot register the death until the postmortem results are received by the Coroner's Office
ga: Ní féidir an bás a chlárú go dtí go mbíonn torthaí an scrúdaithe iarbháis faighte ag Oifig an Chróinéara

source: Read more about death certificates here
ga: Léigh tuilleadh maidir le teastais bháis anseo

source: Prior to inquest (or whilst awaiting the postmortem report) the Coroner will provide on request an Interim Certificate of the Fact of Death
ga: Sula mbíonn an coiste cróinéara ann (nó nuair atá tú ag fanacht le tuairisc an scrúdaithe iarbháis) cuirfidh an Cróinéir Teastas Sealadach Báis ar fáil

source: (This may be acceptable to banks, insurance companies and other institutions but you should check with the institutions for their requirements)
ga: (D'fhéadfadh sé go mbeadh na bainc, comhlachtaí árachais agus institiúidí eile sásta glacadh leis seo ach ba cheart duit teagmháil a dhéanamh leis na hinstitiúidí lena riachtanais a phlé leo)

source: Each year in Ireland, organ donors save the live of countless people
ga: Sábháiltear beatha go leor daoine in Éirinn gach bliain de bharr go ndéanann daoine a mbaill bheatha a dheonadh

source: If someone is an organ donor, but their death is (or will be) reportable to a Coroner, permission of the Coroner and next-of kin is required before organs can be donated
ga: Más deontóir baill bheatha é/í duine, ach más gá a b(h)ás a chur in iúl don Chróinéir, teastaíonn cead ón gCróinéir agus ó na neasghaolta sula ndéantar aon bhall beatha a dheonadh

source: In situations where the Coroner grants permission for donation, the following postmortem examination will be limited
ga: Sa chás go dtugann an Cróinéir cead na baill a dheonadh, beidh teorainn leis an scrúdú iarbháis a dhéantar ina dhiaidh sin

source: It is for the Coroner to decide this matter, following consultation with the Gardai and advice from medical professionals
ga: Is cinneadh don Chróinéir é seo, tar éis dó/dí dul i gcomhairle leis an nGarda agus lucht leighis

source: In general, the Coroner will facilitate requests for organ donation
ga: Go ginearálta, beidh an Cróinéir sásta cead a thabhairt na baill bheatha a dheonadh

source: Read more about body and organ donation in Ireland here
ga: Is féidir tuilleadh a léamh maidir le corp agus baill bheatha a dheonadh in Éirinn anseo

source: Post mortem practice and Organ retention
ga: Scrúduithe Iarbháis agus coinneáil orgáin

source: In May 2005 the Department of Health commissioned a report into post mortem practice and procedures
ga: Choimisiúnaigh an Roinn Sláinte tuarascáil ar chleachtas agus nósanna imeachta iarbháis i mBealtaine 2005

source: The Madden Report (2006) sets out the facts relating to post mortem practice in Ireland (including organ retention) in relation to children born alive and under 12 years between 1970 and 2000
ga: Leagann Tuarascáil Madden (2006) amach na fíricí a bhaineann le cleachtas iarbháis in Éirinn (lena n-áirítear coinneáil orgáin) i leith páistí a rugadh beo agus a bhásaigh agus faoi 12 bliana d'aois idir 1970 agus 2000

source: View the Madden Report on Post Mortem Practice and Procedures and it's recommendations here (pdf)
ga: Féach Tuarascáil Madden ar Chleachtas agus Nósanna Imeachta Iarbháis agus a mholtaí anseo (pdf)

source: The Report makes more than 50 recommendations and in January 2006 the Minister for Health requested an action plan be prepared to implement the recommendations
ga: Tá breis is 50 moladh sa Tuarascáil agus d'iarr an tAire Sláinte i mí Eanáir 2006 go n-ullmhófaí plean gníomhaíochta chun na moltaí seo a chur i bhfeidhm

source: The Minister has also agreed to set up a Working Group to examine issues not covered under the terms of reference of the Madden Report
ga: D'aontaigh an tAire freisin go mbunófaí Grúpa Oibre chun na ceisteanna sin a iniúchadh nár scrúdaíodh faoi théarmaí tagartha Thuarascáil Madden (i

source: That is, post mortem practice in relation to babies in Ireland who died before or during birth, minors over 12 years and adults), etc
ga: naíonáin a fuair bás le linn breithe nó roimhe, mionaoisigh os cionn 12 agus daoine fásta), srl

source: Further information regarding progress on the Action Plan and Working Group will be published when it is available
ga: Foilseofar faisnéis bhreise faoin dul chun cinn nuair a bheidh sí ar fáil
